HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_regdef.h
/** \brief New Data 1 ${i} */
typedef struct _Ifx_CAN_N_NDAT1_Bits
{
    Ifx_UReg_32Bit ND0:1;             /**< \brief [0:0] New Data in Rx Buffer 0 - ND (rwh) */
    Ifx_UReg_32Bit ND1:1;             /**< \brief [1:1] New Data in Rx Buffer 1 - ND (rwh) */
    Ifx_UReg_32Bit ND2:1;             /**< \brief [2:2] New Data in Rx Buffer 2 - ND (rwh) */
    Ifx_UReg_32Bit ND3:1;             /**< \brief [3:3] New Data in Rx Buffer 3 - ND (rwh) */
    Ifx_UReg_32Bit ND4:1;             /**< \brief [4:4] New Data in Rx Buffer 4 - ND (rwh) */
    Ifx_UReg_32Bit ND5:1;             /**< \brief [5:5] New Data in Rx Buffer 5 - ND (rwh) */
    Ifx_UReg_32Bit ND6:1;             /**< \brief [6:6] New Data in Rx Buffer 6 - ND (rwh) */
    Ifx_UReg_32Bit ND7:1;             /**< \brief [7:7] New Data in Rx Buffer 7 - ND (rwh) */
    Ifx_UReg_32Bit ND8:1;             /**< \brief [8:8] New Data in Rx Buffer 8 - ND (rwh) */
    Ifx_UReg_32Bit ND9:1;             /**< \brief [9:9] New Data in Rx Buffer 9 - ND (rwh) */
    Ifx_UReg_32Bit ND10:1;            /**< \brief [10:10] New Data in Rx Buffer 10 - ND (rwh) */
    Ifx_UReg_32Bit ND11:1;            /**< \brief [11:11] New Data in Rx Buffer 11 - ND (rwh) */
    Ifx_UReg_32Bit ND12:1;            /**< \brief [12:12] New Data in Rx Buffer 12 - ND (rwh) */
    Ifx_UReg_32Bit ND13:1;            /**< \brief [13:13] New Data in Rx Buffer 13 - ND (rwh) */
    Ifx_UReg_32Bit ND14:1;            /**< \brief [14:14] New Data in Rx Buffer 14 - ND (rwh) */
    Ifx_UReg_32Bit ND15:1;            /**< \brief [15:15] New Data in Rx Buffer 15 - ND (rwh) */
    Ifx_UReg_32Bit ND16:1;            /**< \brief [16:16] New Data in Rx Buffer 16 - ND (rwh) */
    Ifx_UReg_32Bit ND17:1;            /**< \brief [17:17] New Data in Rx Buffer 17 - ND (rwh) */
    Ifx_UReg_32Bit ND18:1;            /**< \brief [18:18] New Data in Rx Buffer 18 - ND (rwh) */
    Ifx_UReg_32Bit ND19:1;            /**< \brief [19:19] New Data in Rx Buffer 19 - ND (rwh) */
    Ifx_UReg_32Bit ND20:1;            /**< \brief [20:20] New Data in Rx Buffer 20 - ND (rwh) */
    Ifx_UReg_32Bit ND21:1;            /**< \brief [21:21] New Data in Rx Buffer 21 - ND (rwh) */
    Ifx_UReg_32Bit ND22:1;            /**< \brief [22:22] New Data in Rx Buffer 22 - ND (rwh) */
    Ifx_UReg_32Bit ND23:1;            /**< \brief [23:23] New Data in Rx Buffer 23 - ND (rwh) */
    Ifx_UReg_32Bit ND24:1;            /**< \brief [24:24] New Data in Rx Buffer 24 - ND (rwh) */
    Ifx_UReg_32Bit ND25:1;            /**< \brief [25:25] New Data in Rx Buffer 25 - ND (rwh) */
    Ifx_UReg_32Bit ND26:1;            /**< \brief [26:26] New Data in Rx Buffer 26 - ND (rwh) */
    Ifx_UReg_32Bit ND27:1;            /**< \brief [27:27] New Data in Rx Buffer 27 - ND (rwh) */
    Ifx_UReg_32Bit ND28:1;            /**< \brief [28:28] New Data in Rx Buffer 28 - ND (rwh) */
    Ifx_UReg_32Bit ND29:1;            /**< \brief [29:29] New Data in Rx Buffer 29 - ND (rwh) */
    Ifx_UReg_32Bit ND30:1;            /**< \brief [30:30] New Data in Rx Buffer 30 - ND (rwh) */
    Ifx_UReg_32Bit ND31:1;            /**< \brief [31:31] New Data in Rx Buffer 31 - ND (rwh) */
} Ifx_CAN_N_NDAT1_Bits;

/** \brief New Data 2 ${i} */
typedef struct _Ifx_CAN_N_NDAT2_Bits
{
    Ifx_UReg_32Bit ND32:1;            /**< \brief [0:0] New Data in Rx Buffer 32 - ND (rwh) */
    Ifx_UReg_32Bit ND33:1;            /**< \brief [1:1] New Data in Rx Buffer 33 - ND (rwh) */
    Ifx_UReg_32Bit ND34:1;            /**< \brief [2:2] New Data in Rx Buffer 34 - ND (rwh) */
    Ifx_UReg_32Bit ND35:1;            /**< \brief [3:3] New Data in Rx Buffer 35 - ND (rwh) */
    Ifx_UReg_32Bit ND36:1;            /**< \brief [4:4] New Data in Rx Buffer 36 - ND (rwh) */
    Ifx_UReg_32Bit ND37:1;            /**< \brief [5:5] New Data in Rx Buffer 37 - ND (rwh) */
    Ifx_UReg_32Bit ND38:1;            /**< \brief [6:6] New Data in Rx Buffer 38 - ND (rwh) */
    Ifx_UReg_32Bit ND39:1;            /**< \brief [7:7] New Data in Rx Buffer 39 - ND (rwh) */
    Ifx_UReg_32Bit ND40:1;            /**< \brief [8:8] New Data in Rx Buffer 40 - ND (rwh) */
    Ifx_UReg_32Bit ND41:1;            /**< \brief [9:9] New Data in Rx Buffer 41 - ND (rwh) */
    Ifx_UReg_32Bit ND42:1;            /**< \brief [10:10] New Data in Rx Buffer 42 - ND (rwh) */
    Ifx_UReg_32Bit ND43:1;            /**< \brief [11:11] New Data in Rx Buffer 43 - ND (rwh) */
    Ifx_UReg_32Bit ND44:1;            /**< \brief [12:12] New Data in Rx Buffer 44 - ND (rwh) */
    Ifx_UReg_32Bit ND45:1;            /**< \brief [13:13] New Data in Rx Buffer 45 - ND (rwh) */
    Ifx_UReg_32Bit ND46:1;            /**< \brief [14:14] New Data in Rx Buffer 46 - ND (rwh) */
    Ifx_UReg_32Bit ND47:1;            /**< \brief [15:15] New Data in Rx Buffer 47 - ND (rwh) */
    Ifx_UReg_32Bit ND48:1;            /**< \brief [16:16] New Data in Rx Buffer 48 - ND (rwh) */
    Ifx_UReg_32Bit ND49:1;            /**< \brief [17:17] New Data in Rx Buffer 49 - ND (rwh) */
    Ifx_UReg_32Bit ND50:1;            /**< \brief [18:18] New Data in Rx Buffer 50 - ND (rwh) */
    Ifx_UReg_32Bit ND51:1;            /**< \brief [19:19] New Data in Rx Buffer 51 - ND (rwh) */
    Ifx_UReg_32Bit ND52:1;            /**< \brief [20:20] New Data in Rx Buffer 52 - ND (rwh) */
    Ifx_UReg_32Bit ND53:1;            /**< \brief [21:21] New Data in Rx Buffer 53 - ND (rwh) */
    Ifx_UReg_32Bit ND54:1;            /**< \brief [22:22] New Data in Rx Buffer 54 - ND (rwh) */
    Ifx_UReg_32Bit ND55:1;            /**< \brief [23:23] New Data in Rx Buffer 55 - ND (rwh) */
    Ifx_UReg_32Bit ND56:1;            /**< \brief [24:24] New Data in Rx Buffer 56 - ND (rwh) */
    Ifx_UReg_32Bit ND57:1;            /**< \brief [25:25] New Data in Rx Buffer 57 - ND (rwh) */
    Ifx_UReg_32Bit ND58:1;            /**< \brief [26:26] New Data in Rx Buffer 58 - ND (rwh) */
    Ifx_UReg_32Bit ND59:1;            /**< \brief [27:27] New Data in Rx Buffer 59 - ND (rwh) */
    Ifx_UReg_32Bit ND60:1;            /**< \brief [28:28] New Data in Rx Buffer 60 - ND (rwh) */
    Ifx_UReg_32Bit ND61:1;            /**< \brief [29:29] New Data in Rx Buffer 61 - ND (rwh) */
    Ifx_UReg_32Bit ND62:1;            /**< \brief [30:30] New Data in Rx Buffer 62 - ND (rwh) */
    Ifx_UReg_32Bit ND63:1;            /**< \brief [31:31] New Data in Rx Buffer 63 - ND (rwh) */
} Ifx_CAN_N_NDAT2_Bits;

/** \brief Node ${i} Port Control Register */
typedef struct _Ifx_CAN_N_NPCR_Bits
{
    Ifx_UReg_32Bit RXSEL:3;           /**< \brief [2:0] Receive Select - RXSEL (rw) */
    Ifx_UReg_32Bit reserved_3:5;      /**< \brief [7:3] \internal Reserved */
    Ifx_UReg_32Bit LBM:1;             /**< \brief [8:8] Loop-Back Mode - LBM (rw) */
    Ifx_UReg_32Bit LOUT:1;            /**< \brief [9:9] Loop Back Mode Out - LOUT (rw) */
    Ifx_UReg_32Bit DELE:1;            /**< \brief [10:10] Enable destructive read on ECR${i}.CEL - DELE (rw) */
    Ifx_UReg_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CAN_N_NPCR_Bits;

/** \brief Node ${i} Timer A Transmit Trigger Register */
typedef struct _Ifx_CAN_N_NT_ATTR_Bits
{
    Ifx_UReg_32Bit RELOAD:16;         /**< \brief [15:0] Reload Value - RELOAD (rw) */
    Ifx_UReg_32Bit TXMO:8;            /**< \brief [23:16] Transmit Message Object - TXMO (r) */
    Ifx_UReg_32Bit STRT:1;            /**< \brief [24:24] Timer Start - STRT (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_CAN_N_NT_ATTR_Bits;

/** \brief Node ${i} Timer B Transmit Trigger Register */
typedef struct _Ifx_CAN_N_NT_BTTR_Bits
{
    Ifx_UReg_32Bit RELOAD:16;         /**< \brief [15:0] Reload Value - RELOAD (rw) */
    Ifx_UReg_32Bit TXMO:8;            /**< \brief [23:16] Transmit Message Object - TXMO (r) */
    Ifx_UReg_32Bit STRT:1;            /**< \brief [24:24] Timer Start - STRT (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_CAN_N_NT_BTTR_Bits;

/** \brief Node ${i} Timer Clock Control Register */
typedef struct _Ifx_CAN_N_NT_CCR_Bits
{
    Ifx_UReg_32Bit reserved_0:8;      /**< \brief [7:0] \internal Reserved */
    Ifx_UReg_32Bit TPSC:4;            /**< \brief [11:8] Timer Prescaler - TPSC (rw) */
    Ifx_UReg_32Bit reserved_12:2;     /**< \brief [13:12] \internal Reserved */
    Ifx_UReg_32Bit STRESET:1;         /**< \brief [14:14] Stamping Reset - STRESET (rw) */
    Ifx_UReg_32Bit STSTART:1;         /**< \brief [15:15] Stamping Start - STSTART (rw) */
    Ifx_UReg_32Bit reserved_16:2;     /**< \brief [17:16] \internal Reserved */
    Ifx_UReg_32Bit TRIGSRC:3;         /**< \brief [20:18] Trigger Source - TRIGSRC (rw) */
    Ifx_UReg_32Bit reserved_21:11;    /**< \brief [31:21] \internal Reserved */
} Ifx_CAN_N_NT_CCR_Bits;

/** \brief Node ${i} Timer C Transmit Trigger Register */
typedef struct _Ifx_CAN_N_NT_CTTR_Bits
{
    Ifx_UReg_32Bit RELOAD:16;         /**< \brief [15:0] Reload Value - RELOAD (rw) */
    Ifx_UReg_32Bit TXMO:8;            /**< \brief [23:16] Transmit Message Object - TXMO (r) */
    Ifx_UReg_32Bit STRT:1;            /**< \brief [24:24] Timer Start - STRT (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_CAN_N_NT_CTTR_Bits;

/** \brief Node ${i} Timer Receive Timeout Register */
typedef struct _Ifx_CAN_N_NT_RTR_Bits
{
    Ifx_UReg_32Bit RELOAD:16;         /**< \brief [15:0] Reload Value - RELOAD (rw) */
    Ifx_UReg_32Bit reserved_16:6;     /**< \brief [21:16] \internal Reserved */
    Ifx_UReg_32Bit TEIE:1;            /**< \brief [22:22] Timer Event Interrupt Enable - TEIE (rw) */
    Ifx_UReg_32Bit TE:1;              /**< \brief [23:23] Timer Event - TE (rwh) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CAN_N_NT_RTR_Bits;

/** \brief Protocol Status Register ${i} */
typedef struct _Ifx_CAN_N_PSR_Bits
{
    Ifx_UReg_32Bit LEC:3;             /**< \brief [2:0] Last Error Code - LEC (rh) */
    Ifx_UReg_32Bit ACT:2;             /**< \brief [4:3] Activity - ACT (rh) */
    Ifx_UReg_32Bit EP:1;              /**< \brief [5:5] Error Passive - EP (rh) */
    Ifx_UReg_32Bit EW:1;              /**< \brief [6:6] Warning Status - EW (rh) */
    Ifx_UReg_32Bit BO:1;              /**< \brief [7:7] Bus_Off Status - BO (rh) */
    Ifx_UReg_32Bit DLEC:3;            /**< \brief [10:8] Data Phase Last Error Code - DLEC (rh) */
    Ifx_UReg_32Bit RESI:1;            /**< \brief [11:11] ESI flag of last received CAN FD Message - RESI (rh) */
    Ifx_UReg_32Bit RBRS:1;            /**< \brief [12:12] BRS flag of last received CAN FD Message - RBRS (rh) */
    Ifx_UReg_32Bit RFDF:1;            /**< \brief [13:13] Received a CAN FD Message - RFDF (rh) */
    Ifx_UReg_32Bit PXE:1;             /**< \brief [14:14] Protocol Exception Event - PXE (rh) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit TDCV:7;            /**< \brief [22:16] Transmitter Delay Compensation Value - TDCV (r) */
    Ifx_UReg_32Bit reserved_23:9;     /**< \brief [31:23] \internal Reserved */
} Ifx_CAN_N_PSR_Bits;

/** \brief RAM Watchdog ${i} */
typedef struct _Ifx_CAN_N_RWD_Bits
{
    Ifx_UReg_32Bit WDC:8;             /**< \brief [7:0] Watchdog Configuration - WDC (rw) */
    Ifx_UReg_32Bit WDV:8;             /**< \brief [15:8] Watchdog Value - WDV (rh) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CAN_N_RWD_Bits;

/** \brief Rx Buffer Configuration ${i} */
typedef struct _Ifx_CAN_N_RX_BC_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit RBSA:14;           /**< \brief [15:2] Rx Buffer Start Address - RBSA (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CAN_N_RX_BC_Bits;

/** \brief Rx Buffer/FIFO Element Size Configuration ${i} */
typedef struct _Ifx_CAN_N_RX_ESC_Bits
{
    Ifx_UReg_32Bit F0DS:3;            /**< \brief [2:0] Rx FIFO 0 Data Field Size - F0DS (rw) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit F1DS:3;            /**< \brief [6:4] Rx FIFO 1 Data Field Size - F1DS (rw) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit RBDS:3;            /**< \brief [10:8] Rx Buffer Data Field Size - RBDS (rw) */
    Ifx_UReg_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CAN_N_RX_ESC_Bits;

/** \brief Rx FIFO 0 Acknowledge ${i} */
typedef struct _Ifx_CAN_N_RX_F0A_Bits
{
    Ifx_UReg_32Bit F0AI:6;            /**< \brief [5:0] Rx FIFO 0 Acknowledge Index - F0AI (rw) */
    Ifx_UReg_32Bit reserved_6:26;     /**< \brief [31:6] \internal Reserved */
} Ifx_CAN_N_RX_F0A_Bits;

/** \brief Rx FIFO 0 Configuration ${i} */
typedef struct _Ifx_CAN_N_RX_F0C_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit F0SA:14;           /**< \brief [15:2] Rx FIFO 0 Start Address - F0SA (rw) */
    Ifx_UReg_32Bit F0S:7;             /**< \brief [22:16] Rx FIFO 0 Size - F0S (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit F0WM:7;            /**< \brief [30:24] Rx FIFO 0 Watermark - F0WM (rw) */
    Ifx_UReg_32Bit F0OM:1;            /**< \brief [31:31] FIFO 0 Operation Mode - F0OM (rw) */
} Ifx_CAN_N_RX_F0C_Bits;

/** \brief Rx FIFO 0 Status ${i} */
typedef struct _Ifx_CAN_N_RX_F0S_Bits
{
    Ifx_UReg_32Bit F0FL:7;            /**< \brief [6:0] Rx FIFO 0 Fill Level - F0FL (rh) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit F0GI:6;            /**< \brief [13:8] Rx FIFO 0 Get Index - F0GI (rh) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit F0PI:6;            /**< \brief [21:16] Rx FIFO 0 Put Index - F0PI (rh) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit F0F:1;             /**< \brief [24:24] Rx FIFO 0 Full - F0F (rh) */
    Ifx_UReg_32Bit RF0L:1;            /**< \brief [25:25] Rx FIFO 0 Message Lost - RF0L (rh) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_CAN_N_RX_F0S_Bits;

/** \brief Rx FIFO 1 Acknowledge ${i} */
typedef struct _Ifx_CAN_N_RX_F1A_Bits
{
    Ifx_UReg_32Bit F1AI:6;            /**< \brief [5:0] Rx FIFO 1 Acknowledge Index - F1AI (rw) */
    Ifx_UReg_32Bit reserved_6:26;     /**< \brief [31:6] \internal Reserved */
} Ifx_CAN_N_RX_F1A_Bits;

/** \brief Rx FIFO 1 Configuration ${i} */
typedef struct _Ifx_CAN_N_RX_F1C_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit F1SA:14;           /**< \brief [15:2] Rx FIFO 1 Start Address - F1SA (rw) */
    Ifx_UReg_32Bit F1S:7;             /**< \brief [22:16] Rx FIFO 1 Size - F1S (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit F1WM:7;            /**< \brief [30:24] Rx FIFO 1 Watermark - F1WM (rw) */
    Ifx_UReg_32Bit F1OM:1;            /**< \brief [31:31] FIFO 1 Operation Mode - F1OM (rw) */
} Ifx_CAN_N_RX_F1C_Bits;

