HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_regdef.h
/** \brief Protocol Status Register ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_PSR_Bits B;             /**< \brief Bitfield access */
} Ifx_CAN_N_PSR;

/** \brief RAM Watchdog ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RWD_Bits B;             /**< \brief Bitfield access */
} Ifx_CAN_N_RWD;

/** \brief Rx Buffer Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_BC_Bits B;           /**< \brief Bitfield access */
} Ifx_CAN_N_RX_BC;

/** \brief Rx Buffer/FIFO Element Size Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_ESC_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_ESC;

/** \brief Rx FIFO 0 Acknowledge ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_F0A_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_F0A;

/** \brief Rx FIFO 0 Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_F0C_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_F0C;

/** \brief Rx FIFO 0 Status ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_F0S_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_F0S;

/** \brief Rx FIFO 1 Acknowledge ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_F1A_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_F1A;

/** \brief Rx FIFO 1 Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_F1C_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_F1C;

/** \brief Rx FIFO 1 Status ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_RX_F1S_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_RX_F1S;

/** \brief Standard ID Filter Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_SIDFC_Bits B;           /**< \brief Bitfield access */
} Ifx_CAN_N_SIDFC;

/** \brief Start Address Node ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_STARTADR_Bits B;        /**< \brief Bitfield access */
} Ifx_CAN_N_STARTADR;

/** \brief Transmitter Delay Compensation Register ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TDCR_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TDCR;

/** \brief Test Register ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TEST_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TEST;

/** \brief Timeout Counter Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TOCC_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TOCC;

/** \brief Timeout Counter Value ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TOCV_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TOCV;

/** \brief Timestamp Counter Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TSCC_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TSCC;

/** \brief Timestamp Counter Value ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TSCV_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TSCV;

/** \brief Time Trigger Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TTCR_Bits B;            /**< \brief Bitfield access */
} Ifx_CAN_N_TTCR;

/** \brief TT Capture Time ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_CPT_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_CPT;

/** \brief TT Cycle Sync Mark ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_CSM_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_CSM;

/** \brief TT Cycle Time & Count ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_CTC_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_CTC;

/** \brief TT Global Time Preset ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_GTP_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_GTP;

/** \brief TT Interrupt Enable ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_IE_Bits B;           /**< \brief Bitfield access */
} Ifx_CAN_N_TT_IE;

/** \brief TT Interrupt Register ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_IR_Bits B;           /**< \brief Bitfield access */
} Ifx_CAN_N_TT_IR;

/** \brief TT Local & Global Time ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_LGT_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_LGT;

/** \brief TT Matrix Limits ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_MLM_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_MLM;

/** \brief TT Operation Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_OCF_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_OCF;

/** \brief TT Operation Control ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_OCN_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_OCN;

/** \brief TT Operation Status ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_OST_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_OST;

/** \brief TT Reference Message Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_RMC_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_RMC;

/** \brief TT Trigger Memory Configuration ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_TMC_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_TMC;

/** \brief TT Time Mark ${i}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_N_TT_TMK_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_N_TT_TMK;

